deps/wazuh_testing/wazuh_testing/dashboard_saturation_tests/artillery.yml
config:
  # Setting Duration and Concurrent Users
  phases:
    - duration: 10
      arrivalRate: 1
      rampTo: 1
      name: Initial Phase
  # Variables Received by Parameter
  variables:
    username: "{{ username }}"
    password: "{{ password }}"
    screenshots: "{{ screenshots }}"
    session: "{{ session }}"
  engines:
    playwright:
      contextOptions:
        ignoreHTTPSErrors: true
  # File with the Tests
  processor: "./processor.js"
# Prerrequisites
before:
  name: "test_01_login"
  engine: playwright
  flowFunction: "test_login"
# Test Scenarios
scenarios:
  - name: "test_01_login"
    engine: playwright
    testFunction: "test_login"
  - name: "test_02_access_dashboard"
    engine: playwright
    testFunction: "test_accessDashboard"
  - name: "test_03_access_endpoint"
    engine: playwright
    testFunction: "test_accessEndpoint"